module.exports = {
    printWidth: 80, // Максимальная длина строки
    tabWidth: 2, // Ширина табуляции
    useTabs: false, // Использование пробелов вместо табуляций
    semi: true, // Завершение строк точкой с запятой
    singleQuote: true, // Использование одинарных кавычек
    trailingComma: 'all', // Запятая в последнем элементе объекта или массива
    bracketSpacing: true, // Пробелы между скобками в объектах
    arrowParens: 'avoid', // Опускание скобок вокруг единственного аргумента стрелочной функции
};
